[
    {
        "name": "Haus, the blacksmith",
        "text": "Oh, great. Another wanderer in need of something shiny? I'm Haus. If you're looking for weapons or armor, you've come to the right place. Just don't waste my time with idle chatter, I'm busy enough with my work. What can I do for you? Need something hammered or just here to gawk?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "Yeah, yeah, heard you the first time. Name's Haus, I run the blacksmith. You need gear, I make gear. Simple as that. Just don't expect a warm welcome mat. What do you need?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "Oh, for crying out loud! Yes, I got it. You're new. I'm Haus, the blacksmith. I forge weapons and armor. If you need an upgrade, I'm your guy. But asking me to be a tour guide? Not happening. What are you looking for?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "And I'm Haus, the local blacksmith, in case you missed it the last few times. Now that introductions are out of the way, are you here to actually buy something or just testing the echo in here? Weapons, armor—what'll it be?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "Alright! Alright! You're new. We've established that. And I'm still Haus, the blacksmith, dealing with your endless greetings. You need anything crafted, or are we just going to keep up this little song and dance?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "By the forge, are you here just to rattle my nerves? Look, if you're lost, there's plenty of folks in town who give tours. If you need work done on your gear, then talk to me. Otherwise, you're clogging up my workshop. What will it be?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "You've got a knack for testing patience, I'll give you that. Last time—I'm Haus, the blacksmith. You need something made or fixed, say so. Otherwise, I'm not here for idle chit-chat. What's it going to be?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "For the love of iron and anvil, you're like a broken record! New or not, I've got work to do. So, unless you want to see what a hot pair of tongs feels like, let me know if you need any smithing. What do you want?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "Ah, Sarah, my little ray of sunshine in this dusty shop. She's doing well. Always off exploring, collecting bugs and plants. Keeps her out of trouble...most of the time. Thanks for asking. Now, back to business. Are you in need of something?"
    },
    {
        "name": "Haus, the blacksmith",
        "text": "Well, she's probably out chasing butterflies or making friends with the critters somewhere around the village. You'll have to catch her yourself. Now, unless you've got smithing business, I really need to get back to my work."
    },
    {
        "name": "Haus, the blacksmith",
        "text": "Finally! Farewell, and if you ever need something forged, you know where to find me—right here, swamped in work like always. Safe travels, or whatever it is you adventurers say."
    }
]