[
    {
        "name": "Evanora, the medicine woman",
        "text": "Welcome, dear traveler! I am Evanora, the medicine woman of this humble village. If you ever find yourself in need of healing or a bit of herbal wisdom, you need only to ask. How may I assist you today? "
    },
    {
        "name": "Evanora, the medicine woman",
        "text": "Greetings once more! I am Evanora, the medicine woman, here to aid you with my herbs and potions. Should you need anything, don't hesitate to let me know. How may I help you as you become acquainted with our village?"
    },
    {
        "name": "Evanora, the medicine woman",
        "text": "Ah, a fresh face! Welcome to our village, dear one. I'm Evanora, the keeper of nature's remedies. If ever you are in need of healing or a touch of wisdom from the earth, I am here to assist you. Could I perhaps offer guidance as you explore our quaint abode?"
    },
    {
        "name": "Evanora, the medicine woman",
        "text": "Welcome, welcome, bright-eyed wanderer! I am Evanora, the village's matron of healing and herbal lore. Should you find yourself weary from travel or in need of a comforting cure, do not hesitate to visit me. Is there anything I can do for you as you settle into our little haven?"
    },
    {
        "name": "Evanora, the medicine woman",
        "text": "Ah, a new soul graces our village! I am Evanora, the medicine woman, here to offer healing and nature's wisdom. If you find yourself in need of remedies or a soothing word, my door is always open. How may I assist you on your journey here?"
    },
    {
        "name": "Evanora, the medicine woman",
        "text": "Greetings to you, dear traveler! I am Evanora, the keeper of herbal mysteries and healings. How may I assist you on this fine day?"
    },
    {
        "name": "Evanora, the medicine woman",
        "text": "Ah, another new face to grace our village! Welcome, dear traveler. I am Evanora, the medicine woman, here to offer healing potions and wisdom brewed from the earth's bounty. If your journey has been tiring, do let me know how I might help you find comfort."
    },
    {
        "name": "Evanora, the medicine woman",
        "text": "Oh, dear heart, it seems you carry a storm within you. Should you wish for a calming tea or a gentle ear to listen, I'm here whenever you're ready. May peace find you soon."
    }
]